# -*- coding: utf-8 -*-

import requests
import json
import pandas as pd
from lxml import etree
import time

# def get_lines(cityE,city):
#     lst = []
#     for i in range(1,10):
#         url ='http://{}.gongjiao.com/lines_{}.html'.format(cityE,i)
#         r= requests.get(url).text
#         et = etree.HTML(r)
#         line = et.xpath('//div[@class="list"]//a/text()')
#         for l in line:
#             lst.append(l.split(city)[1])
#     return lst
    
def get_dt(city, line):
    url='https://restapi.amap.com/v3/bus/linename?city={}&offset=1&keywords={}&platform=JS&extensions=all&key=624e1a131eb909086c6d1b42fac9ecdf&output=json'.format(city,line)
    r = requests.get(url).text
    rt=json.loads(r)
    try:
        if rt['buslines']:
            print('data available...')
            if len(rt['buslines'])==0:
                print('no data in list...')
            else:
                dt ={}
                dt['line_name']= rt['buslines'][0]['name']
                dt['polyline']= rt['buslines'][0]['polyline']
                dt['total_price']=rt['buslines'][0]['total_price']
                st_name =[]
                st_coords=[]
                for st in rt['buslines'][0]['busstops']:
                    st_name.append(st['name'])
                    st_coords.append(st['location'])
                dt['station_name']= st_name
                dt['station_corrds']= st_coords
                dm = pd.DataFrame([dt])
                print(dm)
                # dm.to_csv('./TransportData/{}_lines.csv'.format(cityE), mode='a', header=False)
                dm.to_csv('./data_api_org/{}_lines.csv'.format(cityE), mode='a', header=False)
        else:
            pass
    except:
            print('error... try it again...')
            time.sleep(2)
            get_dt(city, line)
        
if __name__=="__main__":
    t1 = time.time()
    cityE ='nanjing'
    city ='南京'
    # cityE = 'chengdu'
    # city = '成都'
    # lines_list = get_lines(cityE, city)
    lines_list = ['B1路', 'D12路', '溧水16路', '溧水12路', '135路', '197路(原摄尧线)', '116路', '有轨电车1号线', '高淳107路', '溧水103路', '溧水102路', '江宁11路', '美丽乡村1号线(假日观光线)', 'G1路(假日观光线)', '地铁10号线', '地铁S1号线(机场线)', '高淳109路', '高淳102路', '高淳101路', '溧水13路', 'Y19路', 'Y18路', 'Y17路', 'Y16路', 'Y15路', 'Y14路', 'Y13路', 'Y12路', 'Y11路', 'Y10路', 'Y1路', '机场1号线', '高淳108路', '高淳106路', '高淳105路', '高淳103路', '高淳1路', '高淳K1路', '溧水101路', '溧水15路', '溧水11路', '溧水1路', '中山陵1号线', '中山陵小火车1号线', '机场1号线(城东线)', '江宁19路', '江宁18路', '江宁17路', '江宁16路', '江宁15路', '江宁12路', '江宁10路', '江宁1路', '滨江1号线', '江宁大学城环1线', '江宁快1路', '江宁游1路', '137路区间', '123路', '123路拥军线', 'D10路', 'K1路', '185路', '184路', '180路', '178路', '171路', '159路', '155路', '154路', '149路', '124路', '122路', '119路', '108路', '107路', 'D1路', '游1路', '192路', '191路', '190路', '186路', '183路', '182路', '181路', '181路区间', '179路', '176路', '575路(原175路)', '575路区间(原175路区间)', '174路区间', '174路', '173路', '172路', '170路', '169路', '168路区间(高峰线路)', '168路', '167路', '165路', '164路', '163路', '162路', '161路', '160路', '158路', '157路区间', '157路', '156路', '153路', '152路', '151路', '151路区间', '150路', '148路', '147路', '146路', '145路', '143路', '142路', '141路', '140路', '139路', '138路', '137路', '136路', '136路区间', '134路', '133路', '132路', '132路区间', '131路', '130路', '129路', '128路', '127路', '126路', '125路', '125路区间(高峰线路)', '121路', '120路', '118路', '117路', '115路地铁专线(早高峰班车)', '115路', '114路', '113路', '112路', '111路', '110路', '110路支线(白下高新环线)', '109路', '106路', '105路', '104路', '103路', '102路', '101路区间', '101路', '101路大站快车', '100路', '19路', '18路', '17路', '16路', '14路', '13路', '12路', '11路', '10路', '1路', '地铁1号线南延线', '地铁1号线', '237路', '溧水-杭村线(经246省道)', 'Y28路', '204路', '203路', '202路', '溧水201路', '机场2号线', '美丽乡村2号线(假日观光线)', 'G2路(假日观光线)', 'Y29路(原汉江区间夜间线)', 'Y27路', 'Y26路', 'Y25路', 'Y24路', 'Y23路', 'Y22路', 'Y21路', 'Y20路', 'Y2路', '208路(原南汤线)', '207路(原南上线)', '206路(原南栖线)', '205路', '201路', '高淳2路', '高淳K2路', '溧水2路', '中山陵2号线', '中山陵小火车2号线', '机场2号线(城西线)', '江宁29路', '江宁27路', '江宁23路', '江宁22路', '江宁21路', '江宁20路', '滨江2号线', '江宁2路', 'K2路', 'D2路', '游2路', '29路', '28路', '27路', '26路', '25路', '24路', '23路', '22路', '21路', '20路', '2路', '地铁2号线', '320路', '339路', '319路(高峰线路)', 'Y32路(原玉六夜间线)', 'Y31路', 'Y30路', '美丽乡村3号线(假日观光线)', '336路', '335路', '332路', '330路', '329路', '328路', '337路', '333路', 'Y3路', '机场3号线', '334路', '331路', '溧水3路', '江宁31路', '江宁30路', '滨江3号线', '江宁3路', '327路', '326路', '325路', '324路', '323路', '322路', 'D3路', '游3路', '321路', '318路', '317路', '316路', '315路', '314路', '313路', '312路', '311路', '310路', '309路', '308路', '307路', '306路', '305路', '304路', '303路', '302路', '301路', '39路', '37路', '36路', '35路', '34路', '33路', '32路', '31路', '30路', '3路', '429路环线', '421路(原陈泉线)', '412路(原燕郑线)', '410路(原桥二线)', '404路(原高滨线)', '422路(原九三线)', '484路(原651路)', '483路(原650路)', '486路', '482路', '481路', 'Y4路', '402路(原江西线)', '400路(原江狮线)', '高淳4路', '江宁4路', '游4路', 'D4路', '49路', '48路', '47路', '46路', '45路', '44路', '43路', '42路', '41路', '40路', '4路', '520路城区专线', '501路(原玉六线)', '503路(原中六线)', '513路(原雨乌线)', '515路(原雨石线)', '515路区间(原雨石线区间)', '512路(原浦新线)', '502路(原汉六线)', '572路', '567路', '569路(原168路区间)', '568路', '558路(原157路区间)', '551路', '534路(原151路区间)', '550路', '555路(原136路区间)', '533路(原132路区间)', '511路(原汉江线)', '江宁5路', '524路', '523路', '521路', '520路', '520路高峰专线', 'Y5路', '503路(中六线)', '502路(汉六线)', '510路', '583路', '574路', '569路', '556路', '558路', '557路', '552路', '536路', '532路', '531路', '溧水5路', '游5路', 'D5路', '59路', '58路', '57路', '56路', '55路', '54路', '53路', '52路', '51路', '50路', '5路', '溧水6路', 'G63路', '674路', '673路', '666路', '665路', '655路', '654路', '653路', '672路(原方四2线)', '671路(原方四线)', '619路(原方金线)', '685路(原紫金线)', '684路(原江石线)', '680路(原江浦循环线)', 'G60路(原方灵线)', '670路(原方沪线)', '626路(原方新线)', '678路', '611路区间', '江宁63路', '江宁62路', '江宁61路', '682路', '672路(方四2线)', '671路(方四线)', '652路', '649路', '640路', '638路', '619路(方金线)', 'Y6路', '江宁65路', '江宁64路', '685路(紫金线)', 'G61路', '680路(江浦循环线)', 'G60路(方灵线)', '626路(方新线)', '670路(方沪线)', '664路', 'G62路', '605路', '江宁6路', '648路', '647路', '646路', '645路', '644路', '643路', '642路', '642路区间', '639路', '637路', '636路', '635路', '634路', '633路', '632路', '632路区间', '631路', '630路', '629路', '628路', '627路', '626路(盘渡线)', '625路', '624路', '623路', '622路', '621路', '621路区间', '620路', '618路', '617路', '616路', '615路', '614路', '613路(星石线)', '612路', '611路', '610路', '609路', '608路', '607路', '606路', '605路(江盘线)', '604路', '603路', '602路', '601路', '651路', '650路', '641路', 'D6路', '69路', '68路', '67路', '66路', '65路', '64路', '63路', '62路', '62路区间', '61路', '60路', '6路', '710路(原雨谷线)', '711路(原清安线)', '707路(原宁井线)', '769路(原陆九线)', '743路(原东上线)', '709路(原安铜线)', '712路(原安丹线)', '780路', '719路', '792路', '791路', '768路(原148路)', '737路', '706路', '703路', 'Y7路', '764路', '705路', '704路', '702路', '701路', 'D7路', '79路', '78路', '77路', '76路', '75路', '74路', '73路', '72路', '71路', '70路', '7路', '7路区间', '江宁8路区间', '866路区间(原金陆线区间)', '863路', '862路', '861路', '839路(原义旺线)', '865路', '864路', '868路(原金丹线)', '840路(原广龙线)', '828路(原广科线)', '870路(原谷水线)', '838路(原东旺线)', '836路(原东土线)', '869路(原东谷线)', '874路(原滨江专线)', '831路', '830路', '829路', '873路(原滨江3号线)', '872路(原滨江2号线)', '871路(原滨江1号线)', '853路(原江宁游1路)', '866路(原金陆线)', '867路(原东井线)', '高淳801路', '地铁S8号线(宁天城际)', 'Y8路', '833路(原胜周线)', '842路(原金麒线)', '852路(原金秣线)', '837路(原金汤线)', '832路(原金湖线)', '835路(原东周线)', '851路(原东铜线)', '841路(原东麒线)', '溧水8路', '827路', '826路', '825路', '824路', '823路', '822路', '821路', '820路', '819路', '818路', '817路', '816路', '815路', '814路', '813路', '812路', '811路', '810路', '809路', '808路', '807路', '806路', '805路', '804路', '803路', '802路', '801路', '江宁8路', 'D8路', '89路', '88路', '87路', '86路', '85路', '84路', '83路', '82路', '81路', '80路', '8路', '951路(原秣凤线)', '923路(原周石线)', '921路(原周河线)', '920路(原周和线)', '922路(原周东线)', '910路(原土祝线)', '909路(原土周线)', '911路(原土中线)', '908路(原土远线)', '958路(原铜横线)', '959路(原铜曹线)', '912路(原土湖线)', '962路(原陶云线)', '905路(原汤孟线)', '904路(原汤尚线)', '906路(原上宁线)', '902路(原汤湖线)', '907路(原上插线)', '957路(原铜桑线)', '956路(原禄杨线)', '953路(原禄马线)', '955路(原禄曹线)', '919路(原龙西线)', '918路(原湖新线)', '917路(原湖龙线)', '916路(原湖河线)', '915路(原湖赤线)', '978路(原谷西线)', '975路(原谷桃线)', '977路(原谷农线)', '979路(原谷金线)', '976路(原谷板线)', '973路(原谷柏线)', '952路(原东风线)', '913路(原淳青线)', '903路(原汤桦线)', '901路(原麒西线)', 'Y9路', '溧水9路', '969路', '967路', '968路', '970路', '971路', '972路', '90路区间', 'D9路', '99路', '98路', '97路', '96路', '95路', '94路', '93路', '92路', '91路', '90路', '9路']
    print('{}: 一共有{} 条公交线路'.format(city, len(lines_list)))
    for i,line in enumerate(lines_list):
        print('id {}:{}======================================================='.format(i, line))
        get_dt(city, line)
    t2 = time.time()
    print('一共耗时{}秒'.format(t2 - t1))
    print('ALL DONE!')
    
    ### 运行脚本
    # python Transport.py

    ## 确认到底是不是编码
    # 请在命令行进入该目录，执行下面这段命令：  python -c "print(open('Transport.py','rb').read(120))"
    # 把输出发给我。把输出发给我。
    # 再执行：python -c "import chardet;print(chardet.detect(open('Transport.py','rb').read()))"
    # 如果没有安装： pip install chardet